#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.nat.data.aws_ec2_instance_type.selected: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f71590ffce04a6d]
module.nat.data.aws_ec2_instance_type.selected: Read complete after 0s [id=t4g.nano]
module.nat.data.aws_ami.fck_nat: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0823136d4d8684e]
module.nat.data.aws_vpc.selected: Reading...
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c7d69b1ce54dc090]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08368933c60282243]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d938e60a6926f078]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05b1659ce2fe16e2c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cf27de01155493d6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06c4b56d1b75b8310]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac57b68b9ecc3021]
module.nat.data.aws_ami.fck_nat: Read complete after 0s [id=ami-0f57d652281755ea1]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04da9a7dd058adaee]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0c9c6a3cb3c951e27]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c387144d0f7b1c3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08ff933fc0cd1a8ed]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-06708985e3206850f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09570b4468b3fc794]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0350dc3c543036138]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0762fa9cc0db44716]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07756c215d0f1ed17]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d938e60a6926f0781080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b1443d53ffdace20]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-001198b7fde46da8f]
module.nat.data.aws_subnet.selected: Reading...
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-022d83949d5645880]
module.nat.data.aws_vpc.selected: Read complete after 1s [id=vpc-02f71590ffce04a6d]
module.nat.data.aws_subnet.selected: Read complete after 0s [id=subnet-09570b4468b3fc794]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.nat.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = [
          + "us-east-1a",
        ]
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "vpc-us-east-1-prd-nat-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "prd"
        }
      + tag {
          + key                 = "project"
          + propagate_at_launch = true
          + value               = "aws-core-infra"
        }
      + tag {
          + key                 = "terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.nat.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0f57d652281755ea1"
      + instance_type   = "t4g.nano"
      + latest_version  = (known after apply)
      + name            = "vpc-us-east-1-prd-nat-template"
      + name_prefix     = (known after apply)
      + tags            = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all        = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + network_interface_id = (known after apply)
        }
    }

  # module.nat.aws_network_interface.this will be created
  + resource "aws_network_interface" "this" {
      + arn                       = (known after apply)
      + description               = "vpc-us-east-1-prd-nat-eni"
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = false
      + subnet_id                 = "subnet-09570b4468b3fc794"
      + tags                      = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all                  = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
    }

  # module.nat.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "vpc-us-east-1-prd-nat-sg"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc-us-east-1-prd-nat-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-02f71590ffce04a6d"
    }

  # module.nat.aws_vpc_security_group_egress_rule.all will be created
  + resource "aws_vpc_security_group_egress_rule" "all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic out of vpc-us-east-1-prd-nat-sg"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
    }

  # module.nat.aws_vpc_security_group_ingress_rule.cidr_block will be created
  + resource "aws_vpc_security_group_ingress_rule" "cidr_block" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "Allow all traffic from VPC CIDR block into vpc-us-east-1-prd-nat-sg"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*